WebService/app/controllers/api/v1/markers_controller.rb

SELECT "markers".* FROM "markers"
SELECT COUNT(*) FROM "markers"  WHERE ((title LIKE '%#{params[:search]}%' OR subtitle LIKE '%#{params[:search]}%'))
---
      def index
        markers = Marker.where('(title LIKE :q OR subtitle LIKE :q)',
                               q: '%#{params[:search]}%')

        if markers.any?