WebService/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
      def create
        user = User.new user_params

        if user.save